Tekla Open API Reference for Tekla Structures 2025
HatchAttributes.Color Property
 The color of the hatch.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingHatchColors Color { get; set; }
Public Property Color As DrawingHatchColors
	Get
	Set
Property Value
Type: DrawingHatchColors
See Also
Reference
HatchAttributes Class
Tekla.Structures.Drawing Namespace